In [1]:
import numpy as np
import pandas as pd

In [2]:
mydata = {'me':[3,5,np.NaN],'mf':[7,np.NaN,np.NaN],'mof':[3,5,4]}

In [3]:
mydataframe = pd.DataFrame(mydata)

In [4]:
mydataframe

    me   mf  mof
0  3.0  7.0    3
1  5.0  NaN    5
2  NaN  NaN    4

In [5]:
mydataframe.dropna()

    me   mf  mof
0  3.0  7.0    3

In [8]:
mydataframe.fillna(value= mydataframe['me'].mean())

    me   mf  mof
0  3.0  7.0    3
1  5.0  4.0    5
2  4.0  4.0    4

# Part 2

In [9]:
newdata = {
    'Movies':['star-wars','star-wars','batman','batman','deadpool','deadpool'],
    'Viewers':['me','mf','mof','bobby','dean','sammy'],
    'Ratings':[10,7,6,9,8,5]
}

In [10]:
movieframe = pd.DataFrame(newdata)

In [11]:
movieframe

      Movies Viewers  Ratings
0  star-wars      me       10
1  star-wars      mf        7
2     batman     mof        6
3     batman   bobby        9
4   deadpool    dean        8
5   deadpool   sammy        5

In [13]:
movieframe.groupby('Viewers').mean()

         Ratings
Viewers
bobby          9
dean           8
me            10
mf             7
mof            6
sammy          5

In [15]:
movieframe.groupby('Movies').mean().loc['deadpool']

Ratings    6.5
Name: deadpool, dtype: float64